ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define CLU2CF_OEN__BMASK        0x40 ///< CLU Port Output Enable                           
#define CLU2CF_OEN__SHIFT        0x06 ///< CLU Port Output Enable                           
#define CLU2CF_OEN__DISABLE      0x00 ///< Disables asynchronous output to the selected GPIO
                                      ///< pin                                              
#define CLU2CF_OEN__ENABLE       0x40 ///< Enables asynchronous output to the selected GPIO 
                                      ///< pin                                              
                                                                                            
#define CLU2CF_OUTSEL__BMASK     0x80 ///< CLU Output Select                                
#define CLU2CF_OUTSEL__SHIFT     0x07 ///< CLU Output Select                                
#define CLU2CF_OUTSEL__D_FF      0x00 ///< Select D flip-flop output of CLU                 
#define CLU2CF_OUTSEL__LUT       0x80 ///< Select LUT output.                               
                                                                                            
//------------------------------------------------------------------------------
// CLU2FN Enums (Configurable Logic Unit 2 Function Select @ 0xBC)
//------------------------------------------------------------------------------
#define CLU2FN_FNSEL__FMASK 0xFF ///< CLU Look-Up-Table function select
#define CLU2FN_FNSEL__SHIFT 0x00 ///< CLU Look-Up-Table function select
                                                                       
//------------------------------------------------------------------------------
// CLU2MX Enums (Configurable Logic Unit 2 Multiplexer @ 0x91)
//------------------------------------------------------------------------------
#define CLU2MX_MXB__FMASK   0x0F ///< CLU2 B Input Multiplexer Selection
#define CLU2MX_MXB__SHIFT   0x00 ///< CLU2 B Input Multiplexer Selection
#define CLU2MX_MXB__CLU2B0  0x00 ///< Select CLU2B.0                    
#define CLU2MX_MXB__CLU2B1  0x01 ///< Select CLU2B.1                    
#define CLU2MX_MXB__CLU2B2  0x02 ///< Select CLU2B.2                    
#define CLU2MX_MXB__CLU2B3  0x03 ///< Select CLU2B.3                    
#define CLU2MX_MXB__CLU2B4  0x04 ///< Select CLU2B.4                    
#define CLU2MX_MXB__CLU2B5  0x05 ///< Select CLU2B.5                    
#define CLU2MX_MXB__CLU2B6  0x06 ///< Select CLU2B.6                    
#define CLU2MX_MXB__CLU2B7  0x07 ///< Select CLU2B.7                    
#define CLU2MX_MXB__CLU2B8  0x08 ///< Select CLU2B.8                    
#define CLU2MX_MXB__CLU2B9  0x09 ///< Select CLU2B.9                    
#define CLU2MX_MXB__CLU2B10 0x0A ///< Select CLU2B.10                   
#define CLU2MX_MXB__CLU2B11 0x0B ///< Select CLU2B.11                   
#define CLU2MX_MXB__CLU2B12 0x0C ///< Select CLU2B.12                   
#define CLU2MX_MXB__CLU2B13 0x0D ///< Select CLU2B.13                   
#define CLU2MX_MXB__CLU2B14 0x0E ///< Select CLU2B.14                   
#define CLU2MX_MXB__CLU2B15 0x0F ///< Select CLU2B.15                   
                                                                        
#define CLU2MX_MXA__FMASK   0xF0 ///< CLU2 A Input Multiplexer Selection
#define CLU2MX_MXA__SHIFT   0x04 ///< CLU2 A Input Multiplexer Selection
#define CLU2MX_MXA__CLU2A0  0x00 ///< Select CLU2A.0                    
#define CLU2MX_MXA__CLU2A1  0x10 ///< Select CLU2A.1                    
#define CLU2MX_MXA__CLU2A2  0x20 ///< Select CLU2A.2                    
#define CLU2MX_MXA__CLU2A3  0x30 ///< Select CLU2A.3                    
#define CLU2MX_MXA__CLU2A4  0x40 ///< Select CLU2A.4                    
#define CLU2MX_MXA__CLU2A5  0x50 ///< Select CLU2A.5                    
#define CLU2MX_MXA__CLU2A6  0x60 ///< Select CLU2A.6                    
#define CLU2MX_MXA__CLU2A7  0x70 ///< Select CLU2A.7                    
#define CLU2MX_MXA__CLU2A8  0x80 ///< Select CLU2A.8                    
#define CLU2MX_MXA__CLU2A9  0x90 ///< Select CLU2A.9                    
#define CLU2MX_MXA__CLU2A10 0xA0 ///< Select CLU2A.10                   
#define CLU2MX_MXA__CLU2A11 0xB0 ///< Select CLU2A.11                   
#define CLU2MX_MXA__CLU2A12 0xC0 ///< Select CLU2A.12                   
#define CLU2MX_MXA__CLU2A13 0xD0 ///< Select CLU2A.13                   
#define CLU2MX_MXA__CLU2A14 0xE0 ///< Select CLU2A.14                   
#define CLU2MX_MXA__CLU2A15 0xF0 ///< Select CLU2A.15                   
                                                                        
//------------------------------------------------------------------------------
// CLU3CF Enums (Configurable Logic Unit 3 Configuration @ 0xCA)
//------------------------------------------------------------------------------
#define CLU3CF_CLKSEL__FMASK     0x03 ///< CLU D flip-flop Clock Selection                  
#define CLU3CF_CLKSEL__SHIFT     0x00 ///< CLU D flip-flop Clock Selection                  
#define CLU3CF_CLKSEL__CARRY_IN  0x00 ///< The carry-in signal.                             
#define CLU3CF_CLKSEL__MXA_INPUT 0x01 ///< The MXA input.                                   
#define CLU3CF_CLKSEL__ALTCLK0   0x02 ///< The alternate clock signal CLU3ALTCLK0.          
#define CLU3CF_CLKSEL__ALTCLK1   0x03 ///< The alternate clock signal CLU3ALTCLK1.          
                                                                                            
#define CLU3CF_CLKINV__BMASK     0x04 ///< CLU D flip-flop Clock Invert                     
#define CLU3CF_CLKINV__SHIFT     0x02 ///< CLU D flip-flop Clock Invert                     
#define CLU3CF_CLKINV__NORMAL    0x00 ///< Clock signal is not inverted.                    
#define CLU3CF_CLKINV__INVERT    0x04 ///< Clock signal will be inverted.                   
                                                                                            
#define CLU3CF_RST__BMASK        0x08 ///< CLU D flip-flop Reset                            
#define CLU3CF_RST__SHIFT        0x03 ///< CLU D flip-flop Reset                            
#define CLU3CF_RST__RESET        0x08 ///< Reset the flip flop.                             
                                                                                            
#define CLU3CF_OEN__BMASK        0x40 ///< CLU Port Output Enable                           
#define CLU3CF_OEN__SHIFT        0x06 ///< CLU Port Output Enable                           
#define CLU3CF_OEN__DISABLE      0x00 ///< Disables asynchronous output to the selected GPIO
                                      ///< pin                                              
#define CLU3CF_OEN__ENABLE       0x40 ///< Enables asynchronous output to the selected GPIO 
                                      ///< pin                                              
                                                                                            
#define CLU3CF_OUTSEL__BMASK     0x80 ///< CLU Output Select                                
#define CLU3CF_OUTSEL__SHIFT     0x07 ///< CLU Output Select                                
#define CLU3CF_OUTSEL__D_FF      0x00 ///< Select D flip-flop output of CLU                 
#define CLU3CF_OUTSEL__LUT       0x80 ///< Select LUT output.                               
                                                                                            
//------------------------------------------------------------------------------
// CLU3FN Enums (Configurable Logic Unit 3 Function Select @ 0xC7)
//------------------------------------------------------------------------------
#define CLU3FN_FNSEL__FMASK 0xFF ///< CLU Look-Up-Table function select
#define CLU3FN_FNSEL__SHIFT 0x00 ///< CLU Look-Up-Table function select
                                                                       
//------------------------------------------------------------------------------
// CLU3MX Enums (Configurable Logic Unit 3 Multiplexer @ 0x92)
//------------------------------------------------------------------------------
#define CLU3MX_MXB__FMASK   0x0F ///< CLU3 B Input Multiplexer Selection
#define CLU3MX_MXB__SHIFT   0x00 ///< CLU3 B Input Multiplexer Selection
#define CLU3MX_MXB__CLU3B0  0x00 ///< Select CLU3B.0                    
#define CLU3MX_MXB__CLU3B1  0x01 ///< Select CLU3B.1                    
#define CLU3MX_MXB__CLU3B2  0x02 ///< Select CLU3B.2                    
#define CLU3MX_MXB__CLU3B3  0x03 ///< Select CLU3B.3                    
#define CLU3MX_MXB__CLU3B4  0x04 ///< Select CLU3B.4                    
#define CLU3MX_MXB__CLU3B5  0x05 ///< Select CLU3B.5                    
#define CLU3MX_MXB__CLU3B6  0x06 ///< Select CLU3B.6                    
#define CLU3MX_MXB__CLU3B7  0x07 ///< Select CLU3B.7                    
#define CLU3MX_MXB__CLU3B8  0x08 ///< Select CLU3B.8                    
#define CLU3MX_MXB__CLU3B9  0x09 ///< Select CLU3B.9                    
#define CLU3MX_MXB__CLU3B10 0x0A ///< Select CLU3B.10                   
#define CLU3MX_MXB__CLU3B11 0x0B ///< Select CLU3B.11                   
#define CLU3MX_MXB__CLU3B12 0x0C ///< Select CLU3B.12                   
#define CLU3MX_MXB__CLU3B13 0x0D ///< Select CLU3B.13                   
#define CLU3MX_MXB__CLU3B14 0x0E ///< Select CLU3B.14                   
#define CLU3MX_MXB__CLU3B15 0x0F ///< Select CLU3B.15                   
                                                                        
#define CLU3MX_MXA__FMASK   0xF0 ///< CLU3 A Input Multiplexer Selection
#define CLU3MX_MXA__SHIFT   0x04 ///< CLU3 A Input Multiplexer Selection
#define CLU3MX_MXA__CLU3A0  0x00 ///< Select CLU3A.0                    
#define CLU3MX_MXA__CLU3A1  0x10 ///< Select CLU3A.1                    
#define CLU3MX_MXA__CLU3A2  0x20 ///< Select CLU3A.2                    
#define CLU3MX_MXA__CLU3A3  0x30 ///< Select CLU3A.3                    
#define CLU3MX_MXA__CLU3A4  0x40 ///< Select CLU3A.4                    
#define CLU3MX_MXA__CLU3A5  0x50 ///< Select CLU3A.5                    
#define CLU3MX_MXA__CLU3A6  0x60 ///< Select CLU3A.6                    
#define CLU3MX_MXA__CLU3A7  0x70 ///< Select CLU3A.7                    
#define CLU3MX_MXA__CLU3A8  0x80 ///< Select CLU3A.8                    
#define CLU3MX_MXA__CLU3A9  0x90 ///< Select CLU3A.9                    
#define CLU3MX_MXA__CLU3A10 0xA0 ///< Select CLU3A.10                   
#define CLU3MX_MXA__CLU3A11 0xB0 ///< Select CLU3A.11                   
#define CLU3MX_MXA__CLU3A12 0xC0 ///< Select CLU3A.12                   
#define CLU3MX_MXA__CLU3A13 0xD0 ///< Select CLU3A.13                   
#define CLU3MX_MXA__CLU3A14 0xE0 ///< Select CLU3A.14                   
#define CLU3MX_MXA__CLU3A15 0xF0 ///< Select CLU3A.15                   
                                                                        
//------------------------------------------------------------------------------
// CLEN0 Enums (Configurable Logic Enable 0 @ 0xCB)
//------------------------------------------------------------------------------
#define CLEN0_C0EN__BMASK   0x01 ///< CLU0 Enable                                      
#define CLEN0_C0EN__SHIFT   0x00 ///< CLU0 Enable                                      
#define CLEN0_C0EN__DISABLE 0x00 ///< CLU0 is disabled. The output of the block will be
                                 ///< logic low.                                       
#define CLEN0_C0EN__ENABLE  0x01 ///< CLU0 is enabled.                                 
                                                                                       
#define CLEN0_C1EN__BMASK   0x02 ///< CLU1 Enable                                      
#define CLEN0_C1EN__SHIFT   0x01 ///< CLU1 Enable                                      
#define CLEN0_C1EN__DISABLE 0x00 ///< CLU1 is disabled. The output of the block will be
                                 ///< logic low.                                       
#define CLEN0_C1EN__ENABLE  0x02 ///< CLU1 is enabled.                                 
                                                                                       
#define CLEN0_C2EN__BMASK   0x04 ///< CLU2 Enable                                      
#define CLEN0_C2EN__SHIFT   0x02 ///< CLU2 Enable                                      
#define CLEN0_C2EN__DISABLE 0x00 ///< CLU2 is disabled. The output of the block will be
                                 ///< logic low.                                       
#define CLEN0_C2EN__ENABLE  0x04 ///< CLU2 is enabled.                                 
                                                                                       
