ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define CMP0MD_CPINV__BMASK             0x40 ///< Output Inversion                                  
#define CMP0MD_CPINV__SHIFT             0x06 ///< Output Inversion                                  
#define CMP0MD_CPINV__NORMAL            0x00 ///< Output is not inverted.                           
#define CMP0MD_CPINV__INVERT            0x40 ///< Output is inverted.                               
                                                                                                    
#define CMP0MD_CPLOUT__BMASK            0x80 ///< Comparator Latched Output Flag                    
#define CMP0MD_CPLOUT__SHIFT            0x07 ///< Comparator Latched Output Flag                    
#define CMP0MD_CPLOUT__LOW              0x00 ///< Comparator output was logic low at last PCA       
                                             ///< overflow.                                         
#define CMP0MD_CPLOUT__HIGH             0x80 ///< Comparator output was logic high at last PCA      
                                             ///< overflow.                                         
                                                                                                    
//------------------------------------------------------------------------------
// CMP0MX Enums (Comparator 0 Multiplexer Selection @ 0x9F)
//------------------------------------------------------------------------------
#define CMP0MX_CMXP__FMASK   0x0F ///< Comparator Positive Input MUX Selection
#define CMP0MX_CMXP__SHIFT   0x00 ///< Comparator Positive Input MUX Selection
#define CMP0MX_CMXP__CMP0P0  0x00 ///< External pin CMP0P.0.                  
#define CMP0MX_CMXP__CMP0P1  0x01 ///< External pin CMP0P.1.                  
#define CMP0MX_CMXP__CMP0P2  0x02 ///< External pin CMP0P.2.                  
#define CMP0MX_CMXP__CMP0P3  0x03 ///< External pin CMP0P.3.                  
#define CMP0MX_CMXP__CMP0P4  0x04 ///< External pin CMP0P.4.                  
#define CMP0MX_CMXP__CMP0P5  0x05 ///< External pin CMP0P.5.                  
#define CMP0MX_CMXP__CMP0P6  0x06 ///< External pin CMP0P.6.                  
#define CMP0MX_CMXP__CMP0P7  0x07 ///< External pin CMP0P.7.                  
#define CMP0MX_CMXP__CMP0P8  0x08 ///< External pin CMP0P.8.                  
#define CMP0MX_CMXP__CMP0P9  0x09 ///< External pin CMP0P.9.                  
#define CMP0MX_CMXP__CMP0P10 0x0A ///< External pin CMP0P.10.                 
#define CMP0MX_CMXP__CMP0P11 0x0B ///< External pin CMP0P.11.                 
#define CMP0MX_CMXP__CMP0P12 0x0C ///< External pin CMP0P.12.                 
#define CMP0MX_CMXP__CMP0P15 0x0F ///< External pin CMP0P.15.                 
                                                                              
#define CMP0MX_CMXN__FMASK   0xF0 ///< Comparator Negative Input MUX Selection
#define CMP0MX_CMXN__SHIFT   0x04 ///< Comparator Negative Input MUX Selection
#define CMP0MX_CMXN__CMP0N0  0x00 ///< External pin CMP0N.0.                  
#define CMP0MX_CMXN__CMP0N1  0x10 ///< External pin CMP0N.1.                  
#define CMP0MX_CMXN__CMP0N2  0x20 ///< External pin CMP0N.2.                  
#define CMP0MX_CMXN__CMP0N3  0x30 ///< External pin CMP0N.3.                  
#define CMP0MX_CMXN__CMP0N4  0x40 ///< External pin CMP0N.4.                  
#define CMP0MX_CMXN__CMP0N5  0x50 ///< External pin CMP0N.5.                  
#define CMP0MX_CMXN__CMP0N6  0x60 ///< External pin CMP0N.6.                  
#define CMP0MX_CMXN__CMP0N7  0x70 ///< External pin CMP0N.7.                  
#define CMP0MX_CMXN__CMP0N8  0x80 ///< External pin CMP0N.8.                  
#define CMP0MX_CMXN__CMP0N9  0x90 ///< External pin CMP0N.9.                  
#define CMP0MX_CMXN__CMP0N10 0xA0 ///< External pin CMP0N.10.                 
#define CMP0MX_CMXN__CMP0N11 0xB0 ///< External pin CMP0N.11.                 
#define CMP0MX_CMXN__CMP0N12 0xC0 ///< External pin CMP0N.12.                 
#define CMP0MX_CMXN__CMP0N15 0xF0 ///< External pin CMP0N.15.                 
                                                                              
//------------------------------------------------------------------------------
// CMP1CN0 Enums (Comparator 1 Control 0 @ 0xBF)
//------------------------------------------------------------------------------
#define CMP1CN0_CPHYN__FMASK                0x03 ///< Comparator Negative Hysteresis Control            
#define CMP1CN0_CPHYN__SHIFT                0x00 ///< Comparator Negative Hysteresis Control            
#define CMP1CN0_CPHYN__DISABLED             0x00 ///< Negative Hysteresis disabled.                     
#define CMP1CN0_CPHYN__ENABLED_MODE1        0x01 ///< Negative Hysteresis = Hysteresis 1.               
#define CMP1CN0_CPHYN__ENABLED_MODE2        0x02 ///< Negative Hysteresis = Hysteresis 2.               
#define CMP1CN0_CPHYN__ENABLED_MODE3        0x03 ///< Negative Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                        
#define CMP1CN0_CPHYP__FMASK                0x0C ///< Comparator Positive Hysteresis Control            
#define CMP1CN0_CPHYP__SHIFT                0x02 ///< Comparator Positive Hysteresis Control            
#define CMP1CN0_CPHYP__DISABLED             0x00 ///< Positive Hysteresis disabled.                     
#define CMP1CN0_CPHYP__ENABLED_MODE1        0x04 ///< Positive Hysteresis = Hysteresis 1.               
#define CMP1CN0_CPHYP__ENABLED_MODE2        0x08 ///< Positive Hysteresis = Hysteresis 2.               
#define CMP1CN0_CPHYP__ENABLED_MODE3        0x0C ///< Positive Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                        
#define CMP1CN0_CPFIF__BMASK                0x10 ///< Comparator Falling-Edge Flag                      
#define CMP1CN0_CPFIF__SHIFT                0x04 ///< Comparator Falling-Edge Flag                      
#define CMP1CN0_CPFIF__NOT_SET              0x00 ///< No comparator falling edge has occurred since this
                                                 ///< flag was last cleared.                            
#define CMP1CN0_CPFIF__FALLING_EDGE         0x10 ///< Comparator falling edge has occurred.             
                                                                                                        
