ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define IPH_PHX1__BMASK   0x04 ///< External Interrupt 1 Priority Control MSB                        
#define IPH_PHX1__SHIFT   0x02 ///< External Interrupt 1 Priority Control MSB                        
#define IPH_PHX1__LOW     0x00 ///< External Interrupt 1 priority MSB set to low.                    
#define IPH_PHX1__HIGH    0x04 ///< External Interrupt 1 priority MSB set to high.                   
                                                                                                     
#define IPH_PHT1__BMASK   0x08 ///< Timer 1 Interrupt Priority Control MSB                           
#define IPH_PHT1__SHIFT   0x03 ///< Timer 1 Interrupt Priority Control MSB                           
#define IPH_PHT1__LOW     0x00 ///< Timer 1 interrupt priority MSB set to low.                       
#define IPH_PHT1__HIGH    0x08 ///< Timer 1 interrupt priority MSB set to high.                      
                                                                                                     
#define IPH_PHS1__BMASK   0x10 ///< UART1 Interrupt Priority Control MSB                             
#define IPH_PHS1__SHIFT   0x04 ///< UART1 Interrupt Priority Control MSB                             
#define IPH_PHS1__LOW     0x00 ///< UART1 interrupt priority MSB set to low.                         
#define IPH_PHS1__HIGH    0x10 ///< UART1 interrupt priority MSB set to high.                        
                                                                                                     
#define IPH_PHT2__BMASK   0x20 ///< Timer 2 Interrupt Priority Control MSB                           
#define IPH_PHT2__SHIFT   0x05 ///< Timer 2 Interrupt Priority Control MSB                           
#define IPH_PHT2__LOW     0x00 ///< Timer 2 interrupt priority MSB set to low.                       
#define IPH_PHT2__HIGH    0x20 ///< Timer 2 interrupt priority MSB set to high.                      
                                                                                                     
#define IPH_PHSPI0__BMASK 0x40 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control MSB
#define IPH_PHSPI0__SHIFT 0x06 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control MSB
#define IPH_PHSPI0__LOW   0x00 ///< SPI0 interrupt priority MSB set to low.                          
#define IPH_PHSPI0__HIGH  0x40 ///< SPI0 interrupt priority MSB set to high.                         
                                                                                                     
//------------------------------------------------------------------------------
// LFO0CN Enums (Low Frequency Oscillator Control @ 0xB1)
//------------------------------------------------------------------------------
#define LFO0CN_OSCLD__FMASK       0x03 ///< Internal L-F Oscillator Divider Select           
#define LFO0CN_OSCLD__SHIFT       0x00 ///< Internal L-F Oscillator Divider Select           
#define LFO0CN_OSCLD__DIVIDE_BY_8 0x00 ///< Divide by 8 selected.                            
#define LFO0CN_OSCLD__DIVIDE_BY_4 0x01 ///< Divide by 4 selected.                            
#define LFO0CN_OSCLD__DIVIDE_BY_2 0x02 ///< Divide by 2 selected.                            
#define LFO0CN_OSCLD__DIVIDE_BY_1 0x03 ///< Divide by 1 selected.                            
                                                                                             
#define LFO0CN_OSCLF__FMASK       0x3C ///< Internal L-F Oscillator Frequency Control        
#define LFO0CN_OSCLF__SHIFT       0x02 ///< Internal L-F Oscillator Frequency Control        
                                                                                             
#define LFO0CN_OSCLRDY__BMASK     0x40 ///< Internal L-F Oscillator Ready                    
#define LFO0CN_OSCLRDY__SHIFT     0x06 ///< Internal L-F Oscillator Ready                    
#define LFO0CN_OSCLRDY__NOT_SET   0x00 ///< Internal L-F Oscillator frequency not stabilized.
#define LFO0CN_OSCLRDY__SET       0x40 ///< Internal L-F Oscillator frequency stabilized.    
                                                                                             
#define LFO0CN_OSCLEN__BMASK      0x80 ///< Internal L-F Oscillator Enable                   
#define LFO0CN_OSCLEN__SHIFT      0x07 ///< Internal L-F Oscillator Enable                   
#define LFO0CN_OSCLEN__DISABLED   0x00 ///< Internal L-F Oscillator Disabled.                
#define LFO0CN_OSCLEN__ENABLED    0x80 ///< Internal L-F Oscillator Enabled.                 
                                                                                             
//------------------------------------------------------------------------------
// PRTDRV Enums (Port Drive Strength @ 0xF6)
//------------------------------------------------------------------------------
#define PRTDRV_P0DRV__BMASK      0x01 ///< Port 0 Drive Strength                  
#define PRTDRV_P0DRV__SHIFT      0x00 ///< Port 0 Drive Strength                  
#define PRTDRV_P0DRV__LOW_DRIVE  0x00 ///< All pins on P0 use low drive strength. 
#define PRTDRV_P0DRV__HIGH_DRIVE 0x01 ///< All pins on P0 use high drive strength.
                                                                                  
#define PRTDRV_P1DRV__BMASK      0x02 ///< Port 1 Drive Strength                  
#define PRTDRV_P1DRV__SHIFT      0x01 ///< Port 1 Drive Strength                  
#define PRTDRV_P1DRV__LOW_DRIVE  0x00 ///< All pins on P1 use low drive strength. 
#define PRTDRV_P1DRV__HIGH_DRIVE 0x02 ///< All pins on P1 use high drive strength.
                                                                                  
#define PRTDRV_P2DRV__BMASK      0x04 ///< Port 2 Drive Strength                  
#define PRTDRV_P2DRV__SHIFT      0x02 ///< Port 2 Drive Strength                  
#define PRTDRV_P2DRV__LOW_DRIVE  0x00 ///< All pins on P2 use low drive strength. 
#define PRTDRV_P2DRV__HIGH_DRIVE 0x04 ///< All pins on P2 use high drive strength.
                                                                                  
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_URT1EL__BMASK    0x01 ///< UART1 I/O Legacy Enable                          
#define XBR0_URT1EL__SHIFT    0x00 ///< UART1 I/O Legacy Enable                          
#define XBR0_URT1EL__DISABLED 0x00 ///< UART1 I/O unavailable at Port pin.               
#define XBR0_URT1EL__ENABLED  0x01 ///< UART1 TX0, RX0 routed to Port pins P0.4 and P0.5.
                                                                                         
