ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define UART1LIN_BREAKDN__BMASK      0x40 ///< LIN Break Done Flag                               
#define UART1LIN_BREAKDN__SHIFT      0x06 ///< LIN Break Done Flag                               
#define UART1LIN_BREAKDN__NOT_SET    0x00 ///< A LIN break has not been detected.                
#define UART1LIN_BREAKDN__BREAK      0x40 ///< A LIN break was detected since the flag was last  
                                          ///< cleared.                                          
                                                                                                 
#define UART1LIN_AUTOBDE__BMASK      0x80 ///< Auto Baud Detection Enable                        
#define UART1LIN_AUTOBDE__SHIFT      0x07 ///< Auto Baud Detection Enable                        
#define UART1LIN_AUTOBDE__DISABLED   0x00 ///< Autobaud is not enabled.                          
#define UART1LIN_AUTOBDE__ENABLED    0x80 ///< Autobaud is enabled.                              
                                                                                                 
//------------------------------------------------------------------------------
// UART1PCF Enums (UART1 Configuration @ 0xDA)
//------------------------------------------------------------------------------
#define UART1PCF_RXSEL__FMASK    0x03 ///< RX Source Select                        
#define UART1PCF_RXSEL__SHIFT    0x00 ///< RX Source Select                        
#define UART1PCF_RXSEL__CROSSBAR 0x00 ///< The crossbar input is UART1 RX.         
#define UART1PCF_RXSEL__CLU0     0x01 ///< The CLU0 synchronous output is UART1 RX.
#define UART1PCF_RXSEL__CLU1     0x02 ///< The CLU1 synchronous output is UART1 RX.
#define UART1PCF_RXSEL__CLU2     0x03 ///< The CLU2 synchronous output is UART1 RX.
                                                                                   
//------------------------------------------------------------------------------
// UPD0CC Enums (PD0 CC Configuration @ 0xAA)
//------------------------------------------------------------------------------
#define UPD0CC_ENCC1RD__BMASK    0x01 ///< CC1 RD Pull-Down Enable                           
#define UPD0CC_ENCC1RD__SHIFT    0x00 ///< CC1 RD Pull-Down Enable                           
#define UPD0CC_ENCC1RD__DISABLED 0x00 ///< Disable the RD pull-down resistor.                
#define UPD0CC_ENCC1RD__ENABLED  0x01 ///< Enable the RD pull-down resistor.                 
                                                                                             
#define UPD0CC_ENCC1IP__BMASK    0x02 ///< CC1 Ip Pull-Up Enable                             
#define UPD0CC_ENCC1IP__SHIFT    0x01 ///< CC1 Ip Pull-Up Enable                             
#define UPD0CC_ENCC1IP__DISABLED 0x00 ///< Disable the Ip pull-up current source at the CC1  
                                      ///< pin.                                              
#define UPD0CC_ENCC1IP__ENABLED  0x02 ///< Enable the Ip pull-up current source at the CC1   
                                      ///< pin. The Ip value is configured by the IPPW field.
                                                                                             
#define UPD0CC_CC1OVP__BMASK     0x04 ///< CC1 Overvoltage Flag                              
#define UPD0CC_CC1OVP__SHIFT     0x02 ///< CC1 Overvoltage Flag                              
#define UPD0CC_CC1OVP__NOT_SET   0x00 ///< The CC1 pin voltage is less than or equal to VDD. 
#define UPD0CC_CC1OVP__SET       0x04 ///< The CC1 pin voltage is greater than VDD.          
                                                                                             
#define UPD0CC_ENCC2RD__BMASK    0x08 ///< CC2 RD Pull-Down Enable                           
#define UPD0CC_ENCC2RD__SHIFT    0x03 ///< CC2 RD Pull-Down Enable                           
#define UPD0CC_ENCC2RD__DISABLED 0x00 ///< Disable the RD pull-down resistor.                
#define UPD0CC_ENCC2RD__ENABLED  0x08 ///< Enable the RD pull-down resistor.                 
                                                                                             
#define UPD0CC_ENCC2IP__BMASK    0x10 ///< CC2 Ip Pull-Up Enable                             
#define UPD0CC_ENCC2IP__SHIFT    0x04 ///< CC2 Ip Pull-Up Enable                             
#define UPD0CC_ENCC2IP__DISABLED 0x00 ///< Disable the Ip pull-up current source at the CC2  
                                      ///< pin.                                              
#define UPD0CC_ENCC2IP__ENABLED  0x10 ///< Enable the Ip pull-up current source at the CC2   
                                      ///< pin. The Ip value is configured by the IPPW field.
                                                                                             
#define UPD0CC_CC2OVP__BMASK     0x20 ///< CC2 Overvoltage Flag                              
#define UPD0CC_CC2OVP__SHIFT     0x05 ///< CC2 Overvoltage Flag                              
#define UPD0CC_CC2OVP__NOT_SET   0x00 ///< The CC2 pin voltage is less than or equal to VDD. 
#define UPD0CC_CC2OVP__SET       0x20 ///< The CC2 pin voltage is greater than VDD.          
                                                                                             
#define UPD0CC_AUTOOVP__BMASK    0x40 ///< Automatic Overvoltage Protection Enable           
#define UPD0CC_AUTOOVP__SHIFT    0x06 ///< Automatic Overvoltage Protection Enable           
#define UPD0CC_AUTOOVP__DISABLED 0x00 ///< Disable automatic change in Ip.                   
#define UPD0CC_AUTOOVP__ENABLED  0x40 ///< Enable overvoltage protection of the CC pins by   
                                      ///< switching off Ip current when either CC1OVP or    
                                      ///< CC2OVP are set. This setting functions only when  
                                      ///< ENOVP is set to 1.                                
                                                                                             
#define UPD0CC_ENOVP__BMASK      0x80 ///< Overvoltage Monitor Enable                        
#define UPD0CC_ENOVP__SHIFT      0x07 ///< Overvoltage Monitor Enable                        
#define UPD0CC_ENOVP__DISABLED   0x00 ///< Disable over voltage monitoring for CC1 and CC2.  
#define UPD0CC_ENOVP__ENABLED    0x80 ///< Enable over voltage monitoring for CC1 and CC2.   
                                                                                             
//------------------------------------------------------------------------------
// UPD0CN0 Enums (PD0 Control @ 0x88)
//------------------------------------------------------------------------------
#define UPD0CN0_FORCERX__BMASK    0x01 ///< Force RX Enable                         
#define UPD0CN0_FORCERX__SHIFT    0x00 ///< Force RX Enable                         
#define UPD0CN0_FORCERX__DISABLED 0x00 ///< PD0 Receiver is not enabled during TX.  
#define UPD0CN0_FORCERX__ENABLED  0x01 ///< PD0 Receiver is enabled during TX.      
                                                                                    
#define UPD0CN0_IPPW__FMASK       0x06 ///< Pull-Up Current Source Select           
#define UPD0CN0_IPPW__SHIFT       0x01 ///< Pull-Up Current Source Select           
#define UPD0CN0_IPPW__80_UA       0x02 ///< Configures the current source to 80 uA. 
#define UPD0CN0_IPPW__180_UA      0x04 ///< Configures the current source to 180 uA.
#define UPD0CN0_IPPW__330_UA      0x06 ///< Configures the current source to 330 uA.
                                                                                    
#define UPD0CN0_ENREF__BMASK      0x08 ///< Reference Buffer Enable                 
#define UPD0CN0_ENREF__SHIFT      0x03 ///< Reference Buffer Enable                 
#define UPD0CN0_ENREF__DISABLED   0x00 ///< Disable the PD0 reference buffer.       
#define UPD0CN0_ENREF__ENABLED    0x08 ///< Enable the PD0 reference buffer.        
                                                                                    
#define UPD0CN0_CCSEL__BMASK      0x80 ///< CC Pad Select                           
#define UPD0CN0_CCSEL__SHIFT      0x07 ///< CC Pad Select                           
#define UPD0CN0_CCSEL__CC1        0x00 ///< Selects CC1 pin for CC connection.      
#define UPD0CN0_CCSEL__CC2        0x80 ///< Selects CC2 pin for CC connection.      
                                                                                    
//------------------------------------------------------------------------------
// UPD0CRC0 Enums (PD0 CRC 0 @ 0xA3)
//------------------------------------------------------------------------------
#define UPD0CRC0_CRC0__FMASK 0xFF ///< CRC32 Byte 0
#define UPD0CRC0_CRC0__SHIFT 0x00 ///< CRC32 Byte 0
                                                   
//------------------------------------------------------------------------------
// UPD0CRC1 Enums (PD0 CRC 1 @ 0xA4)
//------------------------------------------------------------------------------
#define UPD0CRC1_CRC1__FMASK 0xFF ///< CRC32 Byte 1
#define UPD0CRC1_CRC1__SHIFT 0x00 ///< CRC32 Byte 1
                                                   
//------------------------------------------------------------------------------
// UPD0CRC2 Enums (PD0 CRC 2 @ 0xA5)
//------------------------------------------------------------------------------
#define UPD0CRC2_CRC2__FMASK 0xFF ///< CRC32 Byte 2
#define UPD0CRC2_CRC2__SHIFT 0x00 ///< CRC32 Byte 2
                                                   
//------------------------------------------------------------------------------
// UPD0CRC3 Enums (PD0 CRC 3 @ 0xA6)
//------------------------------------------------------------------------------
#define UPD0CRC3_CRC3__FMASK 0xFF ///< CRC32 Byte 3
#define UPD0CRC3_CRC3__SHIFT 0x00 ///< CRC32 Byte 3
                                                   
//------------------------------------------------------------------------------
// UPD0DAT Enums (PD0 Transmit and Receive Buffer @ 0x9A)
//------------------------------------------------------------------------------
#define UPD0DAT_PDDAT__FMASK 0xFF ///< PD0 Transmit and Receive Buffer
#define UPD0DAT_PDDAT__SHIFT 0x00 ///< PD0 Transmit and Receive Buffer
                                                                      
//------------------------------------------------------------------------------
// UPD0FCN0 Enums (PD0 FIFO Control 0 @ 0x9B)
//------------------------------------------------------------------------------
#define UPD0FCN0_RXTH__FMASK     0x03 ///< RX FIFO Threshold                                 
#define UPD0FCN0_RXTH__SHIFT     0x00 ///< RX FIFO Threshold                                 
#define UPD0FCN0_RXTH__NOT_EMPTY 0x00 ///< RFRQ will be set anytime new data arrives in the  
                                      ///< RX FIFO (when the RX FIFO is not empty).          
#define UPD0FCN0_RXTH__1_BYTE    0x01 ///< RFRQ will be set if the RX FIFO contains more than
                                      ///< one byte.                                         
                                                                                             
#define UPD0FCN0_RFLSH__BMASK    0x04 ///< RX FIFO Flush                                     
#define UPD0FCN0_RFLSH__SHIFT    0x02 ///< RX FIFO Flush                                     
#define UPD0FCN0_RFLSH__SET      0x04 ///< Flush the RX FIFO.                                
                                                                                             
#define UPD0FCN0_RFRQE__BMASK    0x08 ///< Read Request Interrupt Enable                     
#define UPD0FCN0_RFRQE__SHIFT    0x03 ///< Read Request Interrupt Enable                     
#define UPD0FCN0_RFRQE__DISABLED 0x00 ///< PD0 interrupts will not be generated when RFRQ is 
                                      ///< set.                                              
#define UPD0FCN0_RFRQE__ENABLED  0x08 ///< PD0 interrupts will be generated when RFRQ is set.
                                                                                             
#define UPD0FCN0_TXTH__FMASK     0x30 ///< TX FIFO Threshold                                 
#define UPD0FCN0_TXTH__SHIFT     0x04 ///< TX FIFO Threshold                                 
#define UPD0FCN0_TXTH__EMPTY     0x00 ///< TFRQ will be set when the TX FIFO is empty.       
#define UPD0FCN0_TXTH__1_BYTE    0x10 ///< TFRQ will be set when the TX FIFO contains one or 
                                      ///< fewer bytes.                                      
                                                                                             
#define UPD0FCN0_TFLSH__BMASK    0x40 ///< TX FIFO Flush                                     
#define UPD0FCN0_TFLSH__SHIFT    0x06 ///< TX FIFO Flush                                     
#define UPD0FCN0_TFLSH__SET      0x40 ///< Flush the TX FIFO.                                
                                                                                             
