ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define UPD0INTEN_TXDONEIE__BMASK    0x20 ///< TX Transmit Done Interrupt Enable                 
#define UPD0INTEN_TXDONEIE__SHIFT    0x05 ///< TX Transmit Done Interrupt Enable                 
#define UPD0INTEN_TXDONEIE__DISABLED 0x00 ///< PD0 interrupt will not be generated when the      
                                          ///< TXDONE flag is set.                               
#define UPD0INTEN_TXDONEIE__ENABLED  0x20 ///< PD0 interrupt will be generated when the TXDONE   
                                          ///< flag is set.                                      
                                                                                                 
//------------------------------------------------------------------------------
// UPD0INTSTAT Enums (PD0 Interrupt Status @ 0x9E)
//------------------------------------------------------------------------------
#define UPD0INTSTAT_PRERF__BMASK     0x01 ///< Preamble Received Flag                            
#define UPD0INTSTAT_PRERF__SHIFT     0x00 ///< Preamble Received Flag                            
#define UPD0INTSTAT_PRERF__NOT_SET   0x00 ///< No preamble received.                             
#define UPD0INTSTAT_PRERF__SET       0x01 ///< Preamble received.                                
                                                                                                 
#define UPD0INTSTAT_OSRF__BMASK      0x02 ///< Ordered Set Received Flag                         
#define UPD0INTSTAT_OSRF__SHIFT      0x01 ///< Ordered Set Received Flag                         
#define UPD0INTSTAT_OSRF__NOT_SET    0x00 ///< Ordered set bits not yet received into UPD0RXKC1-4
                                          ///< SFRs.                                             
#define UPD0INTSTAT_OSRF__SET        0x02 ///< Complete ordered set bits received into           
                                          ///< UPD0RXKC1-4 SFRs.                                 
                                                                                                 
#define UPD0INTSTAT_EOPRF__BMASK     0x04 ///< EOP Received Flag                                 
#define UPD0INTSTAT_EOPRF__SHIFT     0x02 ///< EOP Received Flag                                 
#define UPD0INTSTAT_EOPRF__NOT_SET   0x00 ///< EOP has not been received by the PD.              
#define UPD0INTSTAT_EOPRF__SET       0x04 ///< EOP has been received by the PD.                  
                                                                                                 
#define UPD0INTSTAT_IDLEF__BMASK     0x08 ///< CC Line Idle Flag                                 
#define UPD0INTSTAT_IDLEF__SHIFT     0x03 ///< CC Line Idle Flag                                 
#define UPD0INTSTAT_IDLEF__NOT_SET   0x00 ///< RX core has not detected a transition of RXBUSY   
                                          ///< from busy to idle.                                
#define UPD0INTSTAT_IDLEF__SET       0x08 ///< RX core detected a transition of RXBUSY from busy 
                                          ///< to idle.                                          
                                                                                                 
#define UPD0INTSTAT_BMCERRF__BMASK   0x10 ///< Received BMC Error Flag                           
#define UPD0INTSTAT_BMCERRF__SHIFT   0x04 ///< Received BMC Error Flag                           
#define UPD0INTSTAT_BMCERRF__NOT_SET 0x00 ///< BMC error has not occurred.                       
#define UPD0INTSTAT_BMCERRF__SET     0x10 ///< BMC error occurred.                               
                                                                                                 
#define UPD0INTSTAT_TXDONE__BMASK    0x20 ///< TX Transmit Done Flag                             
#define UPD0INTSTAT_TXDONE__SHIFT    0x05 ///< TX Transmit Done Flag                             
#define UPD0INTSTAT_TXDONE__NOT_SET  0x00 ///< The transmit BUSY flag has not transitioned from  
                                          ///< busy to idle.                                     
#define UPD0INTSTAT_TXDONE__SET      0x20 ///< The transmit BUSY flag has transitioned from busy 
                                          ///< to idle.                                          
                                                                                                 
//------------------------------------------------------------------------------
// UPD0RXCN0 Enums (PD0 Receive Control @ 0x91)
//------------------------------------------------------------------------------
#define UPD0RXCN0_EN__BMASK          0x01 ///< PD Receive Enable                                 
#define UPD0RXCN0_EN__SHIFT          0x00 ///< PD Receive Enable                                 
#define UPD0RXCN0_EN__DISABLED       0x00 ///< Disable the PD Receiver.                          
#define UPD0RXCN0_EN__ENABLED        0x01 ///< Enable the PD Receiver when Transmit is not active
                                          ///< unless the FORCERX bit is set.                    
                                                                                                 
#define UPD0RXCN0_RXTO__FMASK        0x06 ///< Receive Timeout                                   
#define UPD0RXCN0_RXTO__SHIFT        0x01 ///< Receive Timeout                                   
#define UPD0RXCN0_RXTO__13_US        0x00 ///< Set RXBUSY when there are more than 2 transitions 
                                          ///< on the CC line in a 13 us window.                 
#define UPD0RXCN0_RXTO__15_US        0x02 ///< Set RXBUSY when there are more than 2 transitions 
                                          ///< on the CC line in a 15 us window.                 
#define UPD0RXCN0_RXTO__17_US        0x04 ///< Set RXBUSY when there are more than 2 transitions 
                                          ///< on the CC line in a 17 us window.                 
#define UPD0RXCN0_RXTO__19_US        0x06 ///< Set RXBUSY when there are more than 2 transitions 
                                          ///< on the CC line in a 19 us window.                 
                                                                                                 
#define UPD0RXCN0_ENLPF__BMASK       0x08 ///< Low Pass Filter Enable                            
#define UPD0RXCN0_ENLPF__SHIFT       0x03 ///< Low Pass Filter Enable                            
#define UPD0RXCN0_ENLPF__DISABLED    0x00 ///< Disable low pass filter.                          
#define UPD0RXCN0_ENLPF__ENABLED     0x08 ///< Enable low pass filter on receiver path.          
                                                                                                 
#define UPD0RXCN0_LOCKP__BMASK       0x10 ///< Preamble Lock Pattern                             
#define UPD0RXCN0_LOCKP__SHIFT       0x04 ///< Preamble Lock Pattern                             
#define UPD0RXCN0_LOCKP__1_PREAMBLE  0x00 ///< 1 preamble pattern (1101 x 1) must be detected to 
                                          ///< recover the clock on the CC line.                 
#define UPD0RXCN0_LOCKP__2_PREAMBLES 0x10 ///< 2 preamble patterns (1101 x 2) must be detected to
                                          ///< recover the clock on the CC line.                 
                                                                                                 
#define UPD0RXCN0_LOCKC__BMASK       0x20 ///< Clock Lock Pattern                                
#define UPD0RXCN0_LOCKC__SHIFT       0x05 ///< Clock Lock Pattern                                
#define UPD0RXCN0_LOCKC__2_PREAMBLES 0x00 ///< 2 preamble patterns (1101 x 2) must be detected to
                                          ///< recover the clock on the CC line.                 
#define UPD0RXCN0_LOCKC__3_PREAMBLES 0x20 ///< 3 preamble patterns (1101 x 3) must be detected to
                                          ///< recover the clock on the CC line.                 
                                                                                                 
