ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define UPD0RXCN0_ENEOPPRE__BMASK    0x40 ///< Preamble EOP Enable                               
#define UPD0RXCN0_ENEOPPRE__SHIFT    0x06 ///< Preamble EOP Enable                               
#define UPD0RXCN0_ENEOPPRE__DISABLED 0x00 ///< Disable EOP detection when a preamble is being    
                                          ///< received.                                         
#define UPD0RXCN0_ENEOPPRE__ENABLED  0x40 ///< Enable EOP detection when a preamble is being     
                                          ///< received.                                         
                                                                                                 
#define UPD0RXCN0_ENSKIDLE__BMASK    0x80 ///< Skip IDLE Enable                                  
#define UPD0RXCN0_ENSKIDLE__SHIFT    0x07 ///< Skip IDLE Enable                                  
#define UPD0RXCN0_ENSKIDLE__DISABLED 0x00 ///< The Idle state must occur after receiving EOP in  
                                          ///< order for the preamble to be detected.            
#define UPD0RXCN0_ENSKIDLE__ENABLED  0x80 ///< The Idle state is not required after receiving EOP
                                          ///< in order for the preamble to be detected.         
                                                                                                 
//------------------------------------------------------------------------------
// UPD0RXKC1 Enums (PD0 Receive KCODE 1 @ 0x93)
//------------------------------------------------------------------------------
#define UPD0RXKC1_KCODE1__FMASK 0x1F ///< First K-Code
#define UPD0RXKC1_KCODE1__SHIFT 0x00 ///< First K-Code
                                                      
//------------------------------------------------------------------------------
// UPD0RXKC2 Enums (PD0 Receive KCODE 2 @ 0x94)
//------------------------------------------------------------------------------
#define UPD0RXKC2_KCODE2__FMASK 0x1F ///< Second K-Code
#define UPD0RXKC2_KCODE2__SHIFT 0x00 ///< Second K-Code
                                                       
//------------------------------------------------------------------------------
// UPD0RXKC3 Enums (PD0 Receive KCODE 3 @ 0x95)
//------------------------------------------------------------------------------
#define UPD0RXKC3_KCODE3__FMASK 0x1F ///< Third K-Code
#define UPD0RXKC3_KCODE3__SHIFT 0x00 ///< Third K-Code
                                                      
//------------------------------------------------------------------------------
// UPD0RXKC4 Enums (PD0 Receive KCODE 4 @ 0x96)
//------------------------------------------------------------------------------
#define UPD0RXKC4_KCODE4__FMASK 0x1F ///< Fourth K-Code
#define UPD0RXKC4_KCODE4__SHIFT 0x00 ///< Fourth K-Code
                                                       
//------------------------------------------------------------------------------
// UPD0RXSHFT Enums (PD0 Receive Shift @ 0xA2)
//------------------------------------------------------------------------------
#define UPD0RXSHFT_RXSHREG__FMASK   0x1F ///< Received BMC Decoded Data                         
#define UPD0RXSHFT_RXSHREG__SHIFT   0x00 ///< Received BMC Decoded Data                         
                                                                                                
#define UPD0RXSHFT_NIBSTAT__BMASK   0x40 ///< Low or High Nibble Indicator                      
#define UPD0RXSHFT_NIBSTAT__SHIFT   0x06 ///< Low or High Nibble Indicator                      
#define UPD0RXSHFT_NIBSTAT__NOT_SET 0x00 ///< The data in RXSHREG decodes into the lower nibble.
#define UPD0RXSHFT_NIBSTAT__SET     0x40 ///< The data in RXSHREG decodes into the upper nibble.
                                                                                                
#define UPD0RXSHFT_BIT5BND__BMASK   0x80 ///< Bit-5 Boundary                                    
#define UPD0RXSHFT_BIT5BND__SHIFT   0x07 ///< Bit-5 Boundary                                    
#define UPD0RXSHFT_BIT5BND__NOT_SET 0x00 ///< RXSHREG does not contain 5 bits of received data. 
#define UPD0RXSHFT_BIT5BND__SET     0x80 ///< RXSHREG contains 5 bits of received data.         
                                                                                                
//------------------------------------------------------------------------------
// UPD0RXSTAT Enums (PD0 Receive Status @ 0x92)
//------------------------------------------------------------------------------
#define UPD0RXSTAT_STATE__FMASK         0x03 ///< PD0 Receive State                                 
#define UPD0RXSTAT_STATE__SHIFT         0x00 ///< PD0 Receive State                                 
#define UPD0RXSTAT_STATE__WAITING       0x00 ///< Waiting for preamble pattern.                     
#define UPD0RXSTAT_STATE__PREAMBLE_REC  0x01 ///< Received preamble pattern, waiting for non-       
                                             ///< preamble 20-bit ordered set K-codes.              
#define UPD0RXSTAT_STATE__WAITING_EOP   0x02 ///< Received 20-bit ordered set K-codes, waiting for  
                                             ///< EOP.                                              
#define UPD0RXSTAT_STATE__REC_EOP       0x03 ///< Received EOP, waiting for idle (RXBUSY = 0).      
                                                                                                    
#define UPD0RXSTAT_CRCERR__BMASK        0x04 ///< CRC Error                                         
#define UPD0RXSTAT_CRCERR__SHIFT        0x02 ///< CRC Error                                         
#define UPD0RXSTAT_CRCERR__NOT_SET      0x00 ///< No CRC error in the current received packet.      
#define UPD0RXSTAT_CRCERR__SET          0x04 ///< CRC error in the current received packet.         
                                                                                                    
#define UPD0RXSTAT_ISNIB__BMASK         0x08 ///< Last FIFO Byte Nibble Status                      
#define UPD0RXSTAT_ISNIB__SHIFT         0x03 ///< Last FIFO Byte Nibble Status                      
#define UPD0RXSTAT_ISNIB__NOT_SET       0x00 ///< The last RX FIFO data contains a full byte of     
                                             ///< data.                                             
#define UPD0RXSTAT_ISNIB__SET           0x08 ///< The last RX FIFO data contains only the low nibble
                                             ///< data.                                             
                                                                                                    
