ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define UPD0RXSTAT_OSTYPE__FMASK        0x70 ///< Ordered Set Type                                  
#define UPD0RXSTAT_OSTYPE__SHIFT        0x04 ///< Ordered Set Type                                  
#define UPD0RXSTAT_OSTYPE__SOP          0x00 ///< SOP.                                              
#define UPD0RXSTAT_OSTYPE__SOP_P        0x10 ///< SOP'.                                             
#define UPD0RXSTAT_OSTYPE__SOP_DP       0x20 ///< SOP''.                                            
#define UPD0RXSTAT_OSTYPE__SOP_P_DEBUG  0x30 ///< SOP' Debug.                                       
#define UPD0RXSTAT_OSTYPE__SOP_DP_DEBUG 0x40 ///< SOP'' Debug.                                      
#define UPD0RXSTAT_OSTYPE__HARD_RESET   0x50 ///< Hard reset.                                       
#define UPD0RXSTAT_OSTYPE__CABLE_RESET  0x60 ///< Cable reset.                                      
#define UPD0RXSTAT_OSTYPE__UNIDENTIFIED 0x70 ///< Unidentified ordered set.                         
                                                                                                    
#define UPD0RXSTAT_RXBUSY__BMASK        0x80 ///< CC Line State                                     
#define UPD0RXSTAT_RXBUSY__SHIFT        0x07 ///< CC Line State                                     
#define UPD0RXSTAT_RXBUSY__NOT_SET      0x00 ///< The CC line is idle.                              
#define UPD0RXSTAT_RXBUSY__SET          0x80 ///< The CC line is busy.                              
                                                                                                    
//------------------------------------------------------------------------------
// UPD0RXTH Enums (PD0 Receive Threshold Configuration @ 0xA1)
//------------------------------------------------------------------------------
#define UPD0RXTH_THF__FMASK     0x07 ///< Falling Edge Receive Threshold                   
#define UPD0RXTH_THF__SHIFT     0x00 ///< Falling Edge Receive Threshold                   
                                                                                           
#define UPD0RXTH_THR__FMASK     0x38 ///< Rising Edge Receive Threshold                    
#define UPD0RXTH_THR__SHIFT     0x03 ///< Rising Edge Receive Threshold                    
                                                                                           
#define UPD0RXTH_THSEL__FMASK   0xC0 ///< Receive Threshold Level Select                   
#define UPD0RXTH_THSEL__SHIFT   0x06 ///< Receive Threshold Level Select                   
#define UPD0RXTH_THSEL__SINK    0x00 ///< THF and THR Threshold levels based on the SINK   
                                     ///< selection.                                       
#define UPD0RXTH_THSEL__SRC     0x40 ///< THF and THR Threshold levels based on the SRC    
                                     ///< selection.                                       
#define UPD0RXTH_THSEL__NEUTRAL 0x80 ///< THF and THR Threshold levels based on the NEUTRAL
                                     ///< selection.                                       
                                                                                           
//------------------------------------------------------------------------------
// UPD0TXCN0 Enums (PD0 Transmit Control 0 @ 0x89)
//------------------------------------------------------------------------------
#define UPD0TXCN0_STARTTX__BMASK    0x01 ///< Start TX Transmission                             
#define UPD0TXCN0_STARTTX__SHIFT    0x00 ///< Start TX Transmission                             
#define UPD0TXCN0_STARTTX__SET      0x01 ///< Start the TX transmission.                        
                                                                                                
#define UPD0TXCN0_ENCORE__BMASK     0x02 ///< TX Driver Enable                                  
#define UPD0TXCN0_ENCORE__SHIFT     0x01 ///< TX Driver Enable                                  
#define UPD0TXCN0_ENCORE__DISABLED  0x00 ///< Disable the TX driver.                            
#define UPD0TXCN0_ENCORE__ENABLED   0x02 ///< Enable the TX driver.                             
                                                                                                
#define UPD0TXCN0_RESET__BMASK      0x04 ///< TX Engine Reset                                   
#define UPD0TXCN0_RESET__SHIFT      0x02 ///< TX Engine Reset                                   
#define UPD0TXCN0_RESET__SET        0x04 ///< Reset the TX engine.                              
                                                                                                
#define UPD0TXCN0_EOPOVR__BMASK     0x08 ///< End-of-Packet Override                            
#define UPD0TXCN0_EOPOVR__SHIFT     0x03 ///< End-of-Packet Override                            
#define UPD0TXCN0_EOPOVR__DISABLED  0x00 ///< Disable override.                                 
#define UPD0TXCN0_EOPOVR__ENABLED   0x08 ///< Transmit an EOP at the next 5-bit boundary in the 
                                         ///< packet to terminate the ongoing transmission      
                                         ///< early.                                            
                                                                                                
#define UPD0TXCN0_CRCEN__BMASK      0x10 ///< CRC Enable                                        
#define UPD0TXCN0_CRCEN__SHIFT      0x04 ///< CRC Enable                                        
#define UPD0TXCN0_CRCEN__DISABLED   0x00 ///< Disable CRC transmission at the end-of-packet. CRC
                                         ///< calculation will still be performed.              
#define UPD0TXCN0_CRCEN__ENABLED    0x10 ///< Enable a CRC calculation of outgoing data and     
                                         ///< transmit the CRC just before the EOP.             
                                                                                                
#define UPD0TXCN0_EOPEN__BMASK      0x20 ///< EOP Enable                                        
#define UPD0TXCN0_EOPEN__SHIFT      0x05 ///< EOP Enable                                        
#define UPD0TXCN0_EOPEN__DISABLED   0x00 ///< No EOP will be sent at the end of the packet.     
#define UPD0TXCN0_EOPEN__ENABLED    0x20 ///< EOP will be sent when there is no more data to    
                                         ///< transmit in the PD0 TX FIFO. This will be sent    
                                         ///< after CRC if CRCEN is 1.                          
                                                                                                
#define UPD0TXCN0_DELAY__BMASK      0x40 ///< TX Start Delay                                    
#define UPD0TXCN0_DELAY__SHIFT      0x06 ///< TX Start Delay                                    
#define UPD0TXCN0_DELAY__1_PERIOD   0x00 ///< Outputs 1 bit period low at the start of          
                                         ///< transmission.                                     
#define UPD0TXCN0_DELAY__2_PERIODS  0x40 ///< Outputs 2 bit periods low at the start of         
                                         ///< transmission.                                     
                                                                                                
#define UPD0TXCN0_BISTCR2__BMASK    0x80 ///< BIST Carrier Mode 2 Enable                        
#define UPD0TXCN0_BISTCR2__SHIFT    0x07 ///< BIST Carrier Mode 2 Enable                        
#define UPD0TXCN0_BISTCR2__DISABLED 0x00 ///< Disable BIST Carrier Mode 2 test operation.       
#define UPD0TXCN0_BISTCR2__ENABLED  0x80 ///< Enable BIST Carrier Mode 2 test operation.        
                                                                                                
//------------------------------------------------------------------------------
// UPD0TXKC1 Enums (PD0 Transmit KCODE 1 @ 0x8B)
//------------------------------------------------------------------------------
#define UPD0TXKC1_KCODE1__FMASK 0x1F ///< First K-Code
#define UPD0TXKC1_KCODE1__SHIFT 0x00 ///< First K-Code
                                                      
//------------------------------------------------------------------------------
// UPD0TXKC2 Enums (PD0 Transmit KCODE 2 @ 0x8C)
//------------------------------------------------------------------------------
#define UPD0TXKC2_KCODE2__FMASK 0x1F ///< Second K-Code
#define UPD0TXKC2_KCODE2__SHIFT 0x00 ///< Second K-Code
                                                       
//------------------------------------------------------------------------------
// UPD0TXKC3 Enums (PD0 Transmit KCODE 3 @ 0x8D)
//------------------------------------------------------------------------------
#define UPD0TXKC3_KCODE3__FMASK 0x1F ///< Third K-Code
#define UPD0TXKC3_KCODE3__SHIFT 0x00 ///< Third K-Code
                                                      
//------------------------------------------------------------------------------
// UPD0TXKC4 Enums (PD0 Transmit KCODE 4 @ 0x8E)
//------------------------------------------------------------------------------
#define UPD0TXKC4_KCODE4__FMASK 0x1F ///< Fourth K-Code
#define UPD0TXKC4_KCODE4__SHIFT 0x00 ///< Fourth K-Code
                                                       
//------------------------------------------------------------------------------
// UPD0TXSTAT Enums (PD0 TX Status @ 0x8A)
//------------------------------------------------------------------------------
#define UPD0TXSTAT_STATE__FMASK             0x0F ///< CC Transmission State                          
#define UPD0TXSTAT_STATE__SHIFT             0x00 ///< CC Transmission State                          
#define UPD0TXSTAT_STATE__IDLE              0x00 ///< Idle.                                          
#define UPD0TXSTAT_STATE__AUTOMATIC_STARTUP 0x01 ///< Automatic startup sequencing state.            
#define UPD0TXSTAT_STATE__DELAYED_STARTUP   0x02 ///< Delayed startup state (for longer low time just
                                                 ///< before start of preamble).                     
#define UPD0TXSTAT_STATE__PREAMBLE          0x03 ///< Preamble transmission state.                   
#define UPD0TXSTAT_STATE__KCODE1            0x04 ///< K-code 1 transmission.                         
#define UPD0TXSTAT_STATE__KCODE2            0x05 ///< K-code 2 transmission.                         
#define UPD0TXSTAT_STATE__KCODE3            0x06 ///< K-code 3 transmission.                         
#define UPD0TXSTAT_STATE__KCODE4            0x07 ///< K-code 4 transmission.                         
#define UPD0TXSTAT_STATE__LOWBMC            0x08 ///< Low-nibble BMC-encoded transmission.           
#define UPD0TXSTAT_STATE__HIGHBMC           0x09 ///< High-nibble BMC-encoded transmission.          
#define UPD0TXSTAT_STATE__LOWCRC            0x0A ///< Low-nibble of BMC-encoded CRC transmission.    
#define UPD0TXSTAT_STATE__HIGHCRC           0x0B ///< High-nibble of BMC-encoded CRC transmission.   
#define UPD0TXSTAT_STATE__EOP               0x0C ///< EOP transmission.                              
#define UPD0TXSTAT_STATE__TERM_EDGE         0x0D ///< Termination of transmission with possible      
                                                 ///< adjustment for trailing edge.                  
#define UPD0TXSTAT_STATE__TERM_LOW          0x0E ///< Termination of transmission with low driving   
                                                 ///< output.                                        
#define UPD0TXSTAT_STATE__BIST              0x0F ///< BIST Carrier Mode 2 transmission.              
                                                                                                     
#define UPD0TXSTAT_BUSY__BMASK              0x80 ///< PD0 TX Busy Flag                               
#define UPD0TXSTAT_BUSY__SHIFT              0x07 ///< PD0 TX Busy Flag                               
#define UPD0TXSTAT_BUSY__NOT_SET            0x00 ///< A transmission is not in progress.             
#define UPD0TXSTAT_BUSY__SET                0x80 ///< A transmission is in progress.                 
                                                                                                     
//------------------------------------------------------------------------------
// UPD1CC Enums (PD1 CC Configuration @ 0xF1)
//------------------------------------------------------------------------------
#define UPD1CC_ENCC1RD__BMASK    0x01 ///< CC1 RD Pull-Down Enable                           
#define UPD1CC_ENCC1RD__SHIFT    0x00 ///< CC1 RD Pull-Down Enable                           
#define UPD1CC_ENCC1RD__DISABLED 0x00 ///< Disable the RD pull-down resistor.                
#define UPD1CC_ENCC1RD__ENABLED  0x01 ///< Enable the RD pull-down resistor.                 
                                                                                             
#define UPD1CC_ENCC1IP__BMASK    0x02 ///< CC1 Ip Pull-Up Enable                             
#define UPD1CC_ENCC1IP__SHIFT    0x01 ///< CC1 Ip Pull-Up Enable                             
#define UPD1CC_ENCC1IP__DISABLED 0x00 ///< Disable the Ip pull-up current source at the CC1  
                                      ///< pin.                                              
#define UPD1CC_ENCC1IP__ENABLED  0x02 ///< Enable the Ip pull-up current source at the CC1   
                                      ///< pin. The Ip value is configured by the IPPW field.
                                                                                             
#define UPD1CC_CC1OVP__BMASK     0x04 ///< CC1 Overvoltage Flag                              
#define UPD1CC_CC1OVP__SHIFT     0x02 ///< CC1 Overvoltage Flag                              
#define UPD1CC_CC1OVP__NOT_SET   0x00 ///< The CC1 pin voltage is less than or equal to VDD. 
#define UPD1CC_CC1OVP__SET       0x04 ///< The CC1 pin voltage is greater than VDD.          
                                                                                             
#define UPD1CC_AUTOOVP__BMASK    0x40 ///< Automatic Overvoltage Protection Enable           
#define UPD1CC_AUTOOVP__SHIFT    0x06 ///< Automatic Overvoltage Protection Enable           
#define UPD1CC_AUTOOVP__DISABLED 0x00 ///< Disable automatic change in Ip.                   
#define UPD1CC_AUTOOVP__ENABLED  0x40 ///< Enable overvoltage protection of the CC pins by   
                                      ///< switching off Ip current when either CC1OVP or    
                                      ///< CC2OVP are set. This setting functions only when  
                                      ///< ENOVP is set to 1.                                
                                                                                             
#define UPD1CC_ENOVP__BMASK      0x80 ///< Overvoltage Monitor Enable                        
#define UPD1CC_ENOVP__SHIFT      0x07 ///< Overvoltage Monitor Enable                        
#define UPD1CC_ENOVP__DISABLED   0x00 ///< Disable over voltage monitoring for CC1 and CC2.  
#define UPD1CC_ENOVP__ENABLED    0x80 ///< Enable over voltage monitoring for CC1 and CC2.   
                                                                                             
//------------------------------------------------------------------------------
// UPD1CN0 Enums (PD1 Control @ 0xC8)
//------------------------------------------------------------------------------
#define UPD1CN0_FORCERX__BMASK    0x01 ///< Force RX Enable                         
#define UPD1CN0_FORCERX__SHIFT    0x00 ///< Force RX Enable                         
#define UPD1CN0_FORCERX__DISABLED 0x00 ///< PD1 Receiver is not enabled during TX.  
#define UPD1CN0_FORCERX__ENABLED  0x01 ///< PD1 Receiver is enabled during TX.      
                                                                                    
#define UPD1CN0_IPPW__FMASK       0x06 ///< Pull-Up Current Source Select           
#define UPD1CN0_IPPW__SHIFT       0x01 ///< Pull-Up Current Source Select           
#define UPD1CN0_IPPW__80_UA       0x02 ///< Configures the current source to 80 uA. 
#define UPD1CN0_IPPW__180_UA      0x04 ///< Configures the current source to 180 uA.
#define UPD1CN0_IPPW__330_UA      0x06 ///< Configures the current source to 330 uA.
                                                                                    
#define UPD1CN0_ENREF__BMASK      0x08 ///< Reference Buffer Enable                 
#define UPD1CN0_ENREF__SHIFT      0x03 ///< Reference Buffer Enable                 
#define UPD1CN0_ENREF__DISABLED   0x00 ///< Disable the PD1 reference buffer.       
#define UPD1CN0_ENREF__ENABLED    0x08 ///< Enable the PD1 reference buffer.        
                                                                                    
//------------------------------------------------------------------------------
// UPD1CRC0 Enums (PD1 CRC 0 @ 0xEB)
//------------------------------------------------------------------------------
#define UPD1CRC0_CRC0__FMASK 0xFF ///< CRC32 Byte 0
#define UPD1CRC0_CRC0__SHIFT 0x00 ///< CRC32 Byte 0
                                                   
//------------------------------------------------------------------------------
// UPD1CRC1 Enums (PD1 CRC 1 @ 0xEC)
//------------------------------------------------------------------------------
#define UPD1CRC1_CRC1__FMASK 0xFF ///< CRC32 Byte 1
#define UPD1CRC1_CRC1__SHIFT 0x00 ///< CRC32 Byte 1
                                                   
//------------------------------------------------------------------------------
// UPD1CRC2 Enums (PD1 CRC 2 @ 0xED)
//------------------------------------------------------------------------------
#define UPD1CRC2_CRC2__FMASK 0xFF ///< CRC32 Byte 2
#define UPD1CRC2_CRC2__SHIFT 0x00 ///< CRC32 Byte 2
                                                   
//------------------------------------------------------------------------------
// UPD1CRC3 Enums (PD1 CRC 3 @ 0xEE)
//------------------------------------------------------------------------------
#define UPD1CRC3_CRC3__FMASK 0xFF ///< CRC32 Byte 3
#define UPD1CRC3_CRC3__SHIFT 0x00 ///< CRC32 Byte 3
                                                   
//------------------------------------------------------------------------------
// UPD1DAT Enums (PD1 Transmit and Receive Buffer @ 0xDA)
//------------------------------------------------------------------------------
#define UPD1DAT_PDDAT__FMASK 0xFF ///< PD1 Transmit and Receive Buffer
#define UPD1DAT_PDDAT__SHIFT 0x00 ///< PD1 Transmit and Receive Buffer
                                                                      
//------------------------------------------------------------------------------
// UPD1FCN0 Enums (PD1 FIFO Control 0 @ 0xDB)
//------------------------------------------------------------------------------
#define UPD1FCN0_RXTH__FMASK     0x03 ///< RX FIFO Threshold                                 
#define UPD1FCN0_RXTH__SHIFT     0x00 ///< RX FIFO Threshold                                 
#define UPD1FCN0_RXTH__NOT_EMPTY 0x00 ///< RFRQ will be set anytime new data arrives in the  
                                      ///< RX FIFO (when the RX FIFO is not empty).          
#define UPD1FCN0_RXTH__1_BYTE    0x01 ///< RFRQ will be set if the RX FIFO contains more than
                                      ///< one byte.                                         
                                                                                             
#define UPD1FCN0_RFLSH__BMASK    0x04 ///< RX FIFO Flush                                     
#define UPD1FCN0_RFLSH__SHIFT    0x02 ///< RX FIFO Flush                                     
#define UPD1FCN0_RFLSH__SET      0x04 ///< Flush the RX FIFO.                                
                                                                                             
#define UPD1FCN0_RFRQE__BMASK    0x08 ///< Read Request Interrupt Enable                     
#define UPD1FCN0_RFRQE__SHIFT    0x03 ///< Read Request Interrupt Enable                     
#define UPD1FCN0_RFRQE__DISABLED 0x00 ///< PD1 interrupts will not be generated when RFRQ is 
                                      ///< set.                                              
#define UPD1FCN0_RFRQE__ENABLED  0x08 ///< PD1 interrupts will be generated when RFRQ is set.
                                                                                             
