ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define UPD1FCN0_TXTH__FMASK     0x30 ///< TX FIFO Threshold                                 
#define UPD1FCN0_TXTH__SHIFT     0x04 ///< TX FIFO Threshold                                 
#define UPD1FCN0_TXTH__EMPTY     0x00 ///< TFRQ will be set when the TX FIFO is empty.       
#define UPD1FCN0_TXTH__1_BYTE    0x10 ///< TFRQ will be set when the TX FIFO contains one or 
                                      ///< fewer bytes.                                      
                                                                                             
#define UPD1FCN0_TFLSH__BMASK    0x40 ///< TX FIFO Flush                                     
#define UPD1FCN0_TFLSH__SHIFT    0x06 ///< TX FIFO Flush                                     
#define UPD1FCN0_TFLSH__SET      0x40 ///< Flush the TX FIFO.                                
                                                                                             
#define UPD1FCN0_TFRQE__BMASK    0x80 ///< Write Request Interrupt Enable                    
#define UPD1FCN0_TFRQE__SHIFT    0x07 ///< Write Request Interrupt Enable                    
#define UPD1FCN0_TFRQE__DISABLED 0x00 ///< PD1 interrupts will not be generated when TFRQ is 
                                      ///< set.                                              
#define UPD1FCN0_TFRQE__ENABLED  0x80 ///< PD1 interrupts will be generated when TFRQ is set.
                                                                                             
//------------------------------------------------------------------------------
// UPD1FCN1 Enums (PD1 FIFO Control 1 @ 0xDC)
//------------------------------------------------------------------------------
#define UPD1FCN1_RXOVRUN__BMASK   0x01 ///< RX FIFO Overrun                                   
#define UPD1FCN1_RXOVRUN__SHIFT   0x00 ///< RX FIFO Overrun                                   
#define UPD1FCN1_RXOVRUN__NOT_SET 0x00 ///< The RX FIFO has not overrun. The last byte was    
                                       ///< received when the RX FIFO was not full.           
#define UPD1FCN1_RXOVRUN__SET     0x01 ///< The RX FIFO has overrun. This occurs when a new   
                                       ///< byte arrives when the RX FIFO is already full.    
                                                                                              
#define UPD1FCN1_RXE__BMASK       0x04 ///< RX FIFO Empty                                     
#define UPD1FCN1_RXE__SHIFT       0x02 ///< RX FIFO Empty                                     
#define UPD1FCN1_RXE__NOT_SET     0x00 ///< The RX FIFO contains data.                        
#define UPD1FCN1_RXE__SET         0x04 ///< The RX FIFO is empty.                             
                                                                                              
#define UPD1FCN1_RFRQ__BMASK      0x08 ///< Receive FIFO Request                              
#define UPD1FCN1_RFRQ__SHIFT      0x03 ///< Receive FIFO Request                              
#define UPD1FCN1_RFRQ__NOT_SET    0x00 ///< The number of bytes in the RX FIFO is less than or
                                       ///< equal to RXTH.                                    
#define UPD1FCN1_RFRQ__SET        0x08 ///< The number of bytes in the RX FIFO is greater than
                                       ///< RXTH.                                             
                                                                                              
#define UPD1FCN1_TXNF__BMASK      0x40 ///< TX FIFO Not Full                                  
#define UPD1FCN1_TXNF__SHIFT      0x06 ///< TX FIFO Not Full                                  
#define UPD1FCN1_TXNF__NOT_SET    0x00 ///< The TX FIFO is full.                              
#define UPD1FCN1_TXNF__SET        0x40 ///< The TX FIFO has room for more data.               
                                                                                              
#define UPD1FCN1_TFRQ__BMASK      0x80 ///< Transmit FIFO Request                             
#define UPD1FCN1_TFRQ__SHIFT      0x07 ///< Transmit FIFO Request                             
#define UPD1FCN1_TFRQ__NOT_SET    0x00 ///< The number of bytes in the TX FIFO is greater than
                                       ///< TXTH.                                             
#define UPD1FCN1_TFRQ__SET        0x80 ///< The number of bytes in the TX FIFO is less than or
                                       ///< equal to TXTH.                                    
                                                                                              
//------------------------------------------------------------------------------
// UPD1FCT Enums (PD1 FIFO Count @ 0xDD)
//------------------------------------------------------------------------------
#define UPD1FCT_RXCNT__FMASK 0x03 ///< RX FIFO Count
#define UPD1FCT_RXCNT__SHIFT 0x00 ///< RX FIFO Count
                                                    
#define UPD1FCT_TXCNT__FMASK 0x30 ///< TX FIFO Count
#define UPD1FCT_TXCNT__SHIFT 0x04 ///< TX FIFO Count
                                                    
//------------------------------------------------------------------------------
// UPD1INTEN Enums (PD1 Interrupt Enable @ 0xDF)
//------------------------------------------------------------------------------
#define UPD1INTEN_PRERIE__BMASK      0x01 ///< Preamble Received Interrupt Enable                
#define UPD1INTEN_PRERIE__SHIFT      0x00 ///< Preamble Received Interrupt Enable                
#define UPD1INTEN_PRERIE__DISABLED   0x00 ///< PD1 interrupt will not be generated when the PRERF
                                          ///< flag is set.                                      
#define UPD1INTEN_PRERIE__ENABLED    0x01 ///< PD1 interrupt will be generated when the PRERF    
                                          ///< flag is set.                                      
                                                                                                 
#define UPD1INTEN_OSRIE__BMASK       0x02 ///< Ordered Set Received Interrupt Enable             
#define UPD1INTEN_OSRIE__SHIFT       0x01 ///< Ordered Set Received Interrupt Enable             
#define UPD1INTEN_OSRIE__DISABLED    0x00 ///< PD1 interrupt will not be generated when the OSRF 
                                          ///< flag is set.                                      
#define UPD1INTEN_OSRIE__ENABLED     0x02 ///< PD1 interrupt will be generated when the OSRF flag
                                          ///< is set.                                           
                                                                                                 
#define UPD1INTEN_EOPRIE__BMASK      0x04 ///< EOP Received Interrupt Enable                     
#define UPD1INTEN_EOPRIE__SHIFT      0x02 ///< EOP Received Interrupt Enable                     
#define UPD1INTEN_EOPRIE__DISABLED   0x00 ///< PD1 interrupt will not be generated when the EOPRF
                                          ///< flag is set.                                      
#define UPD1INTEN_EOPRIE__ENABLED    0x04 ///< PD1 interrupt will be generated when the EOPRF    
                                          ///< flag is set.                                      
                                                                                                 
#define UPD1INTEN_IDLEIE__BMASK      0x08 ///< CC Line Idle Interrupt Enable                     
#define UPD1INTEN_IDLEIE__SHIFT      0x03 ///< CC Line Idle Interrupt Enable                     
#define UPD1INTEN_IDLEIE__DISABLED   0x00 ///< PD1 interrupt will not be generated when the IDLEF
                                          ///< flag is set.                                      
#define UPD1INTEN_IDLEIE__ENABLED    0x08 ///< PD1 interrupt will be generated when the IDLEF    
                                          ///< flag is set.                                      
                                                                                                 
#define UPD1INTEN_BMCERRIE__BMASK    0x10 ///< Received BMC Error Interrupt Enable               
#define UPD1INTEN_BMCERRIE__SHIFT    0x04 ///< Received BMC Error Interrupt Enable               
#define UPD1INTEN_BMCERRIE__DISABLED 0x00 ///< PD1 interrupt will not be generated when the      
                                          ///< BMCERRF flag is set.                              
#define UPD1INTEN_BMCERRIE__ENABLED  0x10 ///< PD1 interrupt will be generated when the BMCERRF  
                                          ///< flag is set.                                      
                                                                                                 
