ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define UPD1RXSTAT_OSTYPE__FMASK        0x70 ///< Ordered Set Type                                  
#define UPD1RXSTAT_OSTYPE__SHIFT        0x04 ///< Ordered Set Type                                  
#define UPD1RXSTAT_OSTYPE__SOP          0x00 ///< SOP.                                              
#define UPD1RXSTAT_OSTYPE__SOP_P        0x10 ///< SOP'.                                             
#define UPD1RXSTAT_OSTYPE__SOP_DP       0x20 ///< SOP''.                                            
#define UPD1RXSTAT_OSTYPE__SOP_P_DEBUG  0x30 ///< SOP' Debug.                                       
#define UPD1RXSTAT_OSTYPE__SOP_DP_DEBUG 0x40 ///< SOP'' Debug.                                      
#define UPD1RXSTAT_OSTYPE__HARD_RESET   0x50 ///< Hard reset.                                       
#define UPD1RXSTAT_OSTYPE__CABLE_RESET  0x60 ///< Cable reset.                                      
#define UPD1RXSTAT_OSTYPE__UNIDENTIFIED 0x70 ///< Unidentified ordered set.                         
                                                                                                    
#define UPD1RXSTAT_RXBUSY__BMASK        0x80 ///< CC Line State                                     
#define UPD1RXSTAT_RXBUSY__SHIFT        0x07 ///< CC Line State                                     
#define UPD1RXSTAT_RXBUSY__NOT_SET      0x00 ///< The CC line is idle.                              
#define UPD1RXSTAT_RXBUSY__SET          0x80 ///< The CC line is busy.                              
                                                                                                    
//------------------------------------------------------------------------------
// UPD1RXTH Enums (PD1 Receive Threshold Configuration @ 0xE9)
//------------------------------------------------------------------------------
#define UPD1RXTH_THF__FMASK     0x07 ///< Falling Edge Receive Threshold                   
#define UPD1RXTH_THF__SHIFT     0x00 ///< Falling Edge Receive Threshold                   
                                                                                           
#define UPD1RXTH_THR__FMASK     0x38 ///< Rising Edge Receive Threshold                    
#define UPD1RXTH_THR__SHIFT     0x03 ///< Rising Edge Receive Threshold                    
                                                                                           
#define UPD1RXTH_THSEL__FMASK   0xC0 ///< Receive Threshold Level Select                   
#define UPD1RXTH_THSEL__SHIFT   0x06 ///< Receive Threshold Level Select                   
#define UPD1RXTH_THSEL__SINK    0x00 ///< THF and THR Threshold levels based on the SINK   
                                     ///< selection.                                       
#define UPD1RXTH_THSEL__SRC     0x40 ///< THF and THR Threshold levels based on the SRC    
                                     ///< selection.                                       
#define UPD1RXTH_THSEL__NEUTRAL 0x80 ///< THF and THR Threshold levels based on the NEUTRAL
                                     ///< selection.                                       
                                                                                           
//------------------------------------------------------------------------------
// UPD1TXCN0 Enums (PD1 Transmit Control 0 @ 0xC9)
//------------------------------------------------------------------------------
#define UPD1TXCN0_STARTTX__BMASK    0x01 ///< Start TX Transmission                             
#define UPD1TXCN0_STARTTX__SHIFT    0x00 ///< Start TX Transmission                             
#define UPD1TXCN0_STARTTX__SET      0x01 ///< Start the TX transmission.                        
                                                                                                
#define UPD1TXCN0_ENCORE__BMASK     0x02 ///< TX Driver Enable                                  
#define UPD1TXCN0_ENCORE__SHIFT     0x01 ///< TX Driver Enable                                  
#define UPD1TXCN0_ENCORE__DISABLED  0x00 ///< Disable the TX driver.                            
#define UPD1TXCN0_ENCORE__ENABLED   0x02 ///< Enable the TX driver.                             
                                                                                                
#define UPD1TXCN0_RESET__BMASK      0x04 ///< TX Engine Reset                                   
#define UPD1TXCN0_RESET__SHIFT      0x02 ///< TX Engine Reset                                   
#define UPD1TXCN0_RESET__SET        0x04 ///< Reset the TX engine.                              
                                                                                                
#define UPD1TXCN0_EOPOVR__BMASK     0x08 ///< End-of-Packet Override                            
#define UPD1TXCN0_EOPOVR__SHIFT     0x03 ///< End-of-Packet Override                            
#define UPD1TXCN0_EOPOVR__DISABLED  0x00 ///< Disable override.                                 
#define UPD1TXCN0_EOPOVR__ENABLED   0x08 ///< Transmit an EOP at the next 5-bit boundary in the 
                                         ///< packet to terminate the ongoing transmission      
                                         ///< early.                                            
                                                                                                
#define UPD1TXCN0_CRCEN__BMASK      0x10 ///< CRC Enable                                        
#define UPD1TXCN0_CRCEN__SHIFT      0x04 ///< CRC Enable                                        
#define UPD1TXCN0_CRCEN__DISABLED   0x00 ///< Disable CRC transmission at the end-of-packet. CRC
                                         ///< calculation will still be performed.              
#define UPD1TXCN0_CRCEN__ENABLED    0x10 ///< Enable a CRC calculation of outgoing data and     
                                         ///< transmit the CRC just before the EOP.             
                                                                                                
#define UPD1TXCN0_EOPEN__BMASK      0x20 ///< EOP Enable                                        
#define UPD1TXCN0_EOPEN__SHIFT      0x05 ///< EOP Enable                                        
#define UPD1TXCN0_EOPEN__DISABLED   0x00 ///< No EOP will be sent at the end of the packet.     
#define UPD1TXCN0_EOPEN__ENABLED    0x20 ///< EOP will be sent when there is no more data to    
                                         ///< transmit in the PD1 TX FIFO. This will be sent    
                                         ///< after CRC if CRCEN is 1.                          
                                                                                                
#define UPD1TXCN0_DELAY__BMASK      0x40 ///< TX Start Delay                                    
#define UPD1TXCN0_DELAY__SHIFT      0x06 ///< TX Start Delay                                    
#define UPD1TXCN0_DELAY__1_PERIOD   0x00 ///< Outputs 1 bit period low at the start of          
                                         ///< transmission.                                     
#define UPD1TXCN0_DELAY__2_PERIODS  0x40 ///< Outputs 2 bit periods low at the start of         
                                         ///< transmission.                                     
                                                                                                
