ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define UPD1TXCN0_BISTCR2__BMASK    0x80 ///< BIST Carrier Mode 2 Enable                        
#define UPD1TXCN0_BISTCR2__SHIFT    0x07 ///< BIST Carrier Mode 2 Enable                        
#define UPD1TXCN0_BISTCR2__DISABLED 0x00 ///< Disable BIST Carrier Mode 2 test operation.       
#define UPD1TXCN0_BISTCR2__ENABLED  0x80 ///< Enable BIST Carrier Mode 2 test operation.        
                                                                                                
//------------------------------------------------------------------------------
// UPD1TXKC1 Enums (PD1 Transmit KCODE 1 @ 0xCB)
//------------------------------------------------------------------------------
#define UPD1TXKC1_KCODE1__FMASK 0x1F ///< First K-Code
#define UPD1TXKC1_KCODE1__SHIFT 0x00 ///< First K-Code
                                                      
//------------------------------------------------------------------------------
// UPD1TXKC2 Enums (PD1 Transmit KCODE 2 @ 0xCC)
//------------------------------------------------------------------------------
#define UPD1TXKC2_KCODE2__FMASK 0x1F ///< Second K-Code
#define UPD1TXKC2_KCODE2__SHIFT 0x00 ///< Second K-Code
                                                       
//------------------------------------------------------------------------------
// UPD1TXKC3 Enums (PD1 Transmit KCODE 3 @ 0xCD)
//------------------------------------------------------------------------------
#define UPD1TXKC3_KCODE3__FMASK 0x1F ///< Third K-Code
#define UPD1TXKC3_KCODE3__SHIFT 0x00 ///< Third K-Code
                                                      
//------------------------------------------------------------------------------
// UPD1TXKC4 Enums (PD1 Transmit KCODE 4 @ 0xCE)
//------------------------------------------------------------------------------
#define UPD1TXKC4_KCODE4__FMASK 0x1F ///< Fourth K-Code
#define UPD1TXKC4_KCODE4__SHIFT 0x00 ///< Fourth K-Code
                                                       
//------------------------------------------------------------------------------
// UPD1TXSTAT Enums (PD1 TX Status @ 0xCA)
//------------------------------------------------------------------------------
#define UPD1TXSTAT_STATE__FMASK             0x0F ///< CC Transmission State                          
#define UPD1TXSTAT_STATE__SHIFT             0x00 ///< CC Transmission State                          
#define UPD1TXSTAT_STATE__IDLE              0x00 ///< Idle.                                          
#define UPD1TXSTAT_STATE__AUTOMATIC_STARTUP 0x01 ///< Automatic startup sequencing state.            
#define UPD1TXSTAT_STATE__DELAYED_STARTUP   0x02 ///< Delayed startup state (for longer low time just
                                                 ///< before start of preamble).                     
#define UPD1TXSTAT_STATE__PREAMBLE          0x03 ///< Preamble transmission state.                   
#define UPD1TXSTAT_STATE__KCODE1            0x04 ///< K-code 1 transmission.                         
#define UPD1TXSTAT_STATE__KCODE2            0x05 ///< K-code 2 transmission.                         
#define UPD1TXSTAT_STATE__KCODE3            0x06 ///< K-code 3 transmission.                         
#define UPD1TXSTAT_STATE__KCODE4            0x07 ///< K-code 4 transmission.                         
#define UPD1TXSTAT_STATE__LOWBMC            0x08 ///< Low-nibble BMC-encoded transmission.           
#define UPD1TXSTAT_STATE__HIGHBMC           0x09 ///< High-nibble BMC-encoded transmission.          
#define UPD1TXSTAT_STATE__LOWCRC            0x0A ///< Low-nibble of BMC-encoded CRC transmission.    
#define UPD1TXSTAT_STATE__HIGHCRC           0x0B ///< High-nibble of BMC-encoded CRC transmission.   
#define UPD1TXSTAT_STATE__EOP               0x0C ///< EOP transmission.                              
#define UPD1TXSTAT_STATE__TERM_EDGE         0x0D ///< Termination of transmission with possible      
                                                 ///< adjustment for trailing edge.                  
#define UPD1TXSTAT_STATE__TERM_LOW          0x0E ///< Termination of transmission with low driving   
                                                 ///< output.                                        
#define UPD1TXSTAT_STATE__BIST              0x0F ///< BIST Carrier Mode 2 transmission.              
                                                                                                     
#define UPD1TXSTAT_BUSY__BMASK              0x80 ///< PD1 TX Busy Flag                               
#define UPD1TXSTAT_BUSY__SHIFT              0x07 ///< PD1 TX Busy Flag                               
#define UPD1TXSTAT_BUSY__NOT_SET            0x00 ///< A transmission is not in progress.             
#define UPD1TXSTAT_BUSY__SET                0x80 ///< A transmission is in progress.                 
                                                                                                     
//------------------------------------------------------------------------------
// CLKREC Enums (USB0 Clock Recovery Control @ 0x0F)
//------------------------------------------------------------------------------
#define CLKREC_CRLOW__BMASK      0x20 ///< Low Speed Clock Recovery Mode               
#define CLKREC_CRLOW__SHIFT      0x05 ///< Low Speed Clock Recovery Mode               
#define CLKREC_CRLOW__FULL_SPEED 0x00 ///< Full Speed Mode.                            
#define CLKREC_CRLOW__LOW_SPEED  0x20 ///< Low Speed Mode.                             
                                                                                       
#define CLKREC_CRSSEN__BMASK     0x40 ///< Clock Recovery Single Step                  
#define CLKREC_CRSSEN__SHIFT     0x06 ///< Clock Recovery Single Step                  
#define CLKREC_CRSSEN__DISABLED  0x00 ///< Disable single-step mode (normal calibration
                                      ///< mode).                                      
#define CLKREC_CRSSEN__ENABLED   0x40 ///< Enable single-step mode.                    
                                                                                       
#define CLKREC_CRE__BMASK        0x80 ///< Clock Recovery Enable                       
#define CLKREC_CRE__SHIFT        0x07 ///< Clock Recovery Enable                       
#define CLKREC_CRE__DISABLED     0x00 ///< Disable clock recovery.                     
#define CLKREC_CRE__ENABLED      0x80 ///< Enable clock recovery.                      
                                                                                       
//------------------------------------------------------------------------------
// CMIE Enums (USB0 Common Interrupt Enable @ 0x0B)
//------------------------------------------------------------------------------
#define CMIE_SUSINTE__BMASK    0x01 ///< Suspend Interrupt Enable       
#define CMIE_SUSINTE__SHIFT    0x00 ///< Suspend Interrupt Enable       
#define CMIE_SUSINTE__DISABLED 0x00 ///< Disable suspend interrupts.    
#define CMIE_SUSINTE__ENABLED  0x01 ///< Enable suspend interrupts.     
                                                                        
#define CMIE_RSUINTE__BMASK    0x02 ///< Resume Interrupt Enable        
#define CMIE_RSUINTE__SHIFT    0x01 ///< Resume Interrupt Enable        
#define CMIE_RSUINTE__DISABLED 0x00 ///< Disable resume interrupts.     
#define CMIE_RSUINTE__ENABLED  0x02 ///< Enable resume interrupts.      
                                                                        
#define CMIE_RSTINTE__BMASK    0x04 ///< Reset Interrupt Enable         
#define CMIE_RSTINTE__SHIFT    0x02 ///< Reset Interrupt Enable         
#define CMIE_RSTINTE__DISABLED 0x00 ///< Disable reset interrupts.      
#define CMIE_RSTINTE__ENABLED  0x04 ///< Enable reset interrupts.       
                                                                        
