ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB4/inc/SI_EFM8UB4_Register_Enums.h
#define USB0CDCN_SDEN__BMASK     0x08 ///< Secondary Detection Enable                       
#define USB0CDCN_SDEN__SHIFT     0x03 ///< Secondary Detection Enable                       
#define USB0CDCN_SDEN__DISABLED  0x00 ///< Disable secondary detection.                     
#define USB0CDCN_SDEN__ENABLED   0x08 ///< Enable secondary detection.                      
                                                                                            
#define USB0CDCN_CHDEN__BMASK    0x10 ///< Charger Detection Enable                         
#define USB0CDCN_CHDEN__SHIFT    0x04 ///< Charger Detection Enable                         
#define USB0CDCN_CHDEN__DISABLED 0x00 ///< Disable the charger detection block.             
#define USB0CDCN_CHDEN__ENABLED  0x10 ///< Enable the charger detection block.              
                                                                                            
//------------------------------------------------------------------------------
// USB0CDSTA Enums (USB0 Charger Detect Status @ 0xBF)
//------------------------------------------------------------------------------
#define USB0CDSTA_DCDTO__BMASK      0x01 ///< Data Contact Detection Timeout                   
#define USB0CDSTA_DCDTO__SHIFT      0x00 ///< Data Contact Detection Timeout                   
#define USB0CDSTA_DCDTO__NO_TIMEOUT 0x00 ///< A DCD timeout was not triggered.                 
#define USB0CDSTA_DCDTO__TIMEOUT    0x01 ///< A DCD timeout was triggered.                     
                                                                                               
#define USB0CDSTA_DCDI__BMASK       0x02 ///< Data Contact Detect Complete                     
#define USB0CDSTA_DCDI__SHIFT       0x01 ///< Data Contact Detect Complete                     
#define USB0CDSTA_DCDI__NOT_SET     0x00 ///< DCD operation has not completed.                 
#define USB0CDSTA_DCDI__SET         0x02 ///< DCD operation has completed. If DCDIE is set to 1
                                         ///< a charger detect interrupt may be generated. This
                                         ///< flag must be cleared by firmware.                
                                                                                               
#define USB0CDSTA_PDI__BMASK        0x04 ///< Primary Detection Complete                       
#define USB0CDSTA_PDI__SHIFT        0x02 ///< Primary Detection Complete                       
#define USB0CDSTA_PDI__NOT_SET      0x00 ///< PD operation has not completed.                  
#define USB0CDSTA_PDI__SET          0x04 ///< PD operation has completed. If PDIE is set to 1 a
                                         ///< charger detect interrupt may be generated. This  
                                         ///< flag must be cleared by firmware.                
                                                                                               
#define USB0CDSTA_SDI__BMASK        0x08 ///< Secondary Detection Complete                     
#define USB0CDSTA_SDI__SHIFT        0x03 ///< Secondary Detection Complete                     
#define USB0CDSTA_SDI__NOT_SET      0x00 ///< SD operation has not completed.                  
#define USB0CDSTA_SDI__SET          0x08 ///< SD operation has completed. If SDIE is set to 1 a
                                         ///< charger detect interrupt may be generated. This  
                                         ///< flag must be cleared by firmware.                
                                                                                               
#define USB0CDSTA_DCP__BMASK        0x10 ///< Dedicated Charging Port Detected                 
#define USB0CDSTA_DCP__SHIFT        0x04 ///< Dedicated Charging Port Detected                 
#define USB0CDSTA_DCP__NOT_DETECTED 0x00 ///< DCP was not detected.                            
#define USB0CDSTA_DCP__DETECTED     0x10 ///< DCP was detected.                                
                                                                                               
#define USB0CDSTA_CDP__BMASK        0x20 ///< Charging Downstream Port Detected                
#define USB0CDSTA_CDP__SHIFT        0x05 ///< Charging Downstream Port Detected                
#define USB0CDSTA_CDP__NOT_DETECTED 0x00 ///< CDP was not detected.                            
#define USB0CDSTA_CDP__DETECTED     0x20 ///< CDP was detected.                                
                                                                                               
#define USB0CDSTA_SDP__BMASK        0x40 ///< Standard Downstream Port Detected                
#define USB0CDSTA_SDP__SHIFT        0x06 ///< Standard Downstream Port Detected                
#define USB0CDSTA_SDP__NOT_DETECTED 0x00 ///< SDP was not detected.                            
#define USB0CDSTA_SDP__DETECTED     0x40 ///< SDP was detected.                                
                                                                                               
#define USB0CDSTA_ERR__BMASK        0x80 ///< USB Charger Detection Error                      
#define USB0CDSTA_ERR__SHIFT        0x07 ///< USB Charger Detection Error                      
#define USB0CDSTA_ERR__NO_ERROR     0x00 ///< No error has occurred.                           
#define USB0CDSTA_ERR__ERROR        0x80 ///< An error has occurred. If enabled, a USB charger 
                                         ///< detect interrupt will be triggered. This bit must
                                         ///< be cleared by firmware.                          
                                                                                               
//------------------------------------------------------------------------------
// USB0CF Enums (USB0 Configuration @ 0xB5)
//------------------------------------------------------------------------------
#define USB0CF_USBCLK__FMASK        0x07 ///< USB0 Clock Source Select Bits                     
#define USB0CF_USBCLK__SHIFT        0x00 ///< USB0 Clock Source Select Bits                     
#define USB0CF_USBCLK__HFOSC1       0x00 ///< USB0 clock (USB0CLK) derived from High-Frequency  
                                         ///< Oscillator 1 (HFOSC1).                            
#define USB0CF_USBCLK__HFOSC1_DIV_8 0x01 ///< USB0 clock (USB0CLK) derived from High-Frequency  
                                         ///< Oscillator 1 / 8 (HFOSC1 / 8).                    
#define USB0CF_USBCLK__EXTOSC       0x02 ///< USB0 clock (USB0CLK) derived from the External    
                                         ///< Oscillator.                                       
#define USB0CF_USBCLK__EXTOSC_DIV_2 0x03 ///< USB0 clock (USB0CLK) derived from the External    
                                         ///< Oscillator / 2.                                   
#define USB0CF_USBCLK__EXTOSC_DIV_3 0x04 ///< USB0 clock (USB0CLK) derived from the External    
                                         ///< Oscillator / 3.                                   
#define USB0CF_USBCLK__EXTOSC_DIV_4 0x05 ///< USB0 clock (USB0CLK) derived from the External    
                                         ///< Oscillator / 4.                                   
#define USB0CF_USBCLK__LFOSC        0x06 ///< USB0 clock (USB0CLK) derived from the Internal    
                                         ///< Low-Frequency Oscillator.                         
#define USB0CF_USBCLK__NOCLOCK      0x07 ///< USB0 clock (USB0CLK) is turned off.               
                                                                                                
